{"meta":{"title":"Augusdn","subtitle":"Augusdn's IT Blog","description":"한국어로 운영하는 블로그","author":"Augustine Lee","url":"https://augusdn.github.io/kr"},"pages":[{"title":"My Blog Name | 404","date":"2017-12-28T07:19:19.000Z","updated":"2018-02-03T12:50:10.317Z","comments":true,"path":"404.html","permalink":"https://augusdn.github.io/kr/404.html","excerpt":"","text":""},{"title":"404 Page Not Found","date":"2017-12-28T09:56:11.000Z","updated":"2018-02-03T12:50:10.318Z","comments":true,"path":"/404.html","permalink":"https://augusdn.github.io/kr//404.html","excerpt":"","text":"페이지를 찾을 수 없습니다."}],"posts":[{"title":"hexo theme","slug":"hexo-theme","date":"2018-01-21T08:20:33.000Z","updated":"2018-02-03T12:50:10.337Z","comments":true,"path":"2018/01/21/hexo-theme/","link":"","permalink":"https://augusdn.github.io/kr/2018/01/21/hexo-theme/","excerpt":"","text":"HuemanI’ve tried variety of themes for Hexo blog, but the best one yet I found wasI will go through how to apply Hexo Hueman theme on the blog. Install Customise Menu About Logo Theme colour Highlight Sidebar Thumbnail Favicon My favicon is not appearing Social links Widgets Link Search Comment Share Plugins Google_analytics Open_graph installGo to your blog root folder, then use the following command to download the theme.1$ git clone https://github.com/ppoffice/hexo-theme-hueman.git themes/hueman Open /blog_root_folder/_config.yml with your preferred text editor and change the following line.1234old: theme:new: theme: hueman Go to /blog_root_foler/themes/ and rename _config.yml.example into _config.yml then open it. If you want to use search function (Insight search)) provided by hueman theme, you have to install hexo-generator-json-content with npm. 1$ npm install -S hexo-generator-json-content customiseYou can customise your blog theme with the blog_root_folder/themes/_config.yml. menuYou can add your own menu.If you add categories in front-matter when you write a post, hexo will automatically add your category into menu on the bar. front-matter is located on top of the md file when you create a new post. It includes title, date, and etc. 1234menu: Home: /hexo-theme-hueman/ About: /hexo-theme-hueman/about/index.html GitHub: https://github.com aboutYou can add a page abour yourself in /about/index.html but there is no page available by default.If you try to access it with out creating one, you will face 404 page not found error. logo1234logo: width: 165 height: 60 url: images/logo-header.png You can modify url to your own logo image. Image url can be one from web, or you can save image into /root_folder/source/images/ then access them by /images/filename.png theme colourYou can modify the colour of your blog.1theme_color: &apos;#d35&apos; highlightHighlight setting allow you to adjust colours of your code block. You can use default but you can choose one from hueman/source/css/_highlight.1highlight: androidstudio sidebarYou can choose where your sidebar will located.1sidebar: left # options: left, right thumbnailIf this option is true, your blog will have thumbnail for each post you make.1thumbnail: true You can add customised thumbnail in front-matter part of your post. Otherwise hexo will add the first photo in the post automatically.123title: Hello Worlddate: 2013/7/13 20:46:25thumbnail: https://example.com/image.jpg faviconFavicon is a little icon located right next to your URL. image type can be .ico or .png1favicon: favicon.png my favicon is not appearingIn most of the cases, if your favicon is not appearing after you made changes to your favicon, this occurs due to stored cache in your browser.Solutions can be Delete cache of your browser Use different browser Use incognito modeI prefer incognito mode in chrome to see changes. social linksYou can add/delete/modify sns links that you use. You can check the icon list in FontAwesome.123social_links: github: https://github.com/ppoffice/hexo-theme-hueman youtube: https://youtube.com widgets1234567widgets: - recent_posts - category - archive - tag - tagcloud - links You can delete them if you don’t want them on your side menu. linkYou can add your own custom links at bottom of the _config.yml12345# Miscellaneousmiscellaneous: links: Hexo: http://hexo.io custom_Link: http://custom.blah.com searchTo use this function, you have to install hexo-generator-json-content prior to activate this.Also I prefer using Insight search, not sure about other two since they look like chinese search engines.12345# Searchsearch: insight: true swiftype: baidu: false commentThis theme provide multiple comment services but I use Disqus because others are chinese services. Signup with disqus and get shorname from them, then copt and paste to _config.yml 12345# Commentcomment: disqus: futurecreator # copy and paste disqus shortname duoshuo: youyan: shareHueman also provide share option to share the post on sns. default addtoany jiathis (Chinese) bdshare (Chinese)12# Shareshare: addtoany # options: jiathis, bdshare, addtoany, default pluginsThey also provide plugin options such as Open Graph, Google analytics and etc. google_analytics1google_analytics: UA-66666666-6 open_graph12345open_graph: fb_app_id: fb_admins: twitter_id: google_plus:","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"Hexo","slug":"Dev/Hexo","permalink":"https://augusdn.github.io/kr/categories/Dev/Hexo/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://augusdn.github.io/kr/tags/Hexo/"},{"name":"Blog","slug":"Blog","permalink":"https://augusdn.github.io/kr/tags/Blog/"},{"name":"GitHub","slug":"GitHub","permalink":"https://augusdn.github.io/kr/tags/GitHub/"},{"name":"Node.js","slug":"Node-js","permalink":"https://augusdn.github.io/kr/tags/Node-js/"},{"name":"Git","slug":"Git","permalink":"https://augusdn.github.io/kr/tags/Git/"}]},{"title":"Make new blog with GitHub Page with Hexo","slug":"Make-new-blog-with-GitHub-Page-with-Hexo","date":"2018-01-11T11:45:48.000Z","updated":"2018-02-03T12:50:10.335Z","comments":true,"path":"2018/01/11/Make-new-blog-with-GitHub-Page-with-Hexo/","link":"","permalink":"https://augusdn.github.io/kr/2018/01/11/Make-new-blog-with-GitHub-Page-with-Hexo/","excerpt":"","text":"Make your own blog Make your own blog Create new GitHub repository Difference between User and Project Page Install Hexo Settings Write a new post Create new GitHub repositoryFirstly, we have to create new repository at GitHub to save all the static files.Get on to GitHub and click on New Repository Difference between User and Project Page USER Project URL username.github.io username.github.io/repository_name Unless you are willing to make a sub directory under your root domain username.github.io/example, name your repository with username.github.io or username.github.com.But both of them will have domain username.github.io Install HexoYou can check out the older post to install Hexo SettingsYou can manage settings of your blog with _config.yml file.But at the moment, lets set up URL and Deployment first._config.yaml123456789101112131415161718# Sitetitle: Augusdn # Title of your blogsubtitle: Blog of my life # Sub titledescription: Blog description # Blog descriptionauthor: Augusdn # Name of authorlanguage: en # default language of theme, most of the themes support multi languagetimezone: Australia/Sydney # Set Timezone (https://en.wikipedia.org/wiki/List_of_tz_database_time_zones)# URLurl: https://user_name.github.io/ # Your github page addressroot: / # default by / but if you have sub dir, you can choose where it should set root aspermalink: :year/:month/:day/:title/ # default URL for new post. ex) 2018/01/01/new_postpermalink_defaults:# Deploymentdeploy: type: git repo: https://github.com/user_name/user_name.github.io.git Now, lets try generate static files and push it to GitHub. 1hexo g -d In most of the cases, you can write your post or draft and check on your local server before you push it to remote.After push, you can check your blog at user_name.github.io.In my situation, it will be augusdn.github.io Write a new postLets make a new post with following command1$ hexo new post 'post name' You can check this post file in [blog_folder]/sources/_postsEdit this file as you like, with Markdown Editor, then check with local server.1$ hexo server Then check your new post at localhost:4000Confirm your posts and generate, then push it to github.1hexo g -d","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"Hexo","slug":"Dev/Hexo","permalink":"https://augusdn.github.io/kr/categories/Dev/Hexo/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://augusdn.github.io/kr/tags/Hexo/"},{"name":"Blog","slug":"Blog","permalink":"https://augusdn.github.io/kr/tags/Blog/"},{"name":"GitHub","slug":"GitHub","permalink":"https://augusdn.github.io/kr/tags/GitHub/"},{"name":"Node.js","slug":"Node-js","permalink":"https://augusdn.github.io/kr/tags/Node-js/"},{"name":"Git","slug":"Git","permalink":"https://augusdn.github.io/kr/tags/Git/"}]},{"title":"How to fix Deployer not found: git","slug":"How-to-fix-Deployer-not-found-git","date":"2018-01-11T11:38:51.000Z","updated":"2018-02-03T12:50:10.335Z","comments":true,"path":"2018/01/11/How-to-fix-Deployer-not-found-git/","link":"","permalink":"https://augusdn.github.io/kr/2018/01/11/How-to-fix-Deployer-not-found-git/","excerpt":"","text":"ERROR Deployer not found: gitThis error occurs, if you don’t install hexo-deployer-git but attempt to deploy. Solution1$ npm install hexo-deployer-git --save Then open _config.yml, fix #deployment123456# Deployment## Docs: https://hexo.io/docs/deployment.htmldeploy: type: git repo: https://github.com/your_github_id/your_github_id.github.io.git branch: master","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"Hexo","slug":"Dev/Hexo","permalink":"https://augusdn.github.io/kr/categories/Dev/Hexo/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://augusdn.github.io/kr/tags/Hexo/"},{"name":"Blog","slug":"Blog","permalink":"https://augusdn.github.io/kr/tags/Blog/"},{"name":"GitHub","slug":"GitHub","permalink":"https://augusdn.github.io/kr/tags/GitHub/"},{"name":"Node.js","slug":"Node-js","permalink":"https://augusdn.github.io/kr/tags/Node-js/"},{"name":"Git","slug":"Git","permalink":"https://augusdn.github.io/kr/tags/Git/"}]},{"title":"Hexo, blog framework","slug":"Hexo-blog-framework","date":"2018-01-11T10:34:23.000Z","updated":"2018-02-03T12:50:10.333Z","comments":true,"path":"2018/01/11/Hexo-blog-framework/","link":"","permalink":"https://augusdn.github.io/kr/2018/01/11/Hexo-blog-framework/","excerpt":"","text":"HexoHexo is a fast, simple and powerful blog framework based on Node.js. Hexo Installation Requirements Install Git Install Node.js Install Hexo Hexo setup Run Commands This blog is written in Markdown, using Hexo and GitHub Pages due to following reasons. Support Markdown, allow you to post easily. Free hosting from GitHub Pages. Users are able to use a wide variety of Themes. InstallationRequirementsHexo requires couple of things installed on your machine to run. Node.js Git If you already installed these, you can skip to Hexo installation Install Git Windows: Download &amp; install git. Mac: Install it with Homebrew, MacPorts or installer. Linux (Ubuntu, Debian): sudo apt-get install git-core Linux (Fedora, Red Hat, CentOS): sudo yum install git-core Install Node.jsThe best way to install Node.js is with Node Version Manager.Thankfully the creators of nvm provide a simple script that automatically installs nvm: cURL:1$ curl -o- https://raw.githubusercontent.com/creationix/nvm/v0.33.2/install.sh | bash Wget:1$ wget -qO- https://raw.githubusercontent.com/creationix/nvm/v0.33.2/install.sh | bash Once nvm is installed, restart the terminal and run the following command to install Node.js:1$ nvm install stable Alternatively, download and run the installer. Install HexoOnce all the requirements are installed, you can install Hexo with npm:12$ npm install -g hexo-cli$ npm install hexo-deployer-git --save Hexo setupAfter installing Hexo, you can set up a new folder for your blog.123$ hexo init &lt;blog_folder_name&gt;$ cd &lt;blog_folder_name&gt;$ npm install Result:12345678.├── _config.yml : configuration file for blog├── package.json : list of packages in json format├── scaffolds : scaffolds folder make you able to set up initial seed for post or drafts├── source : source folder to store markdown files and all other files for blogging| ├── _drafts | └── _posts └── themes : folder to store themes, hexo generate blog based on files in source, and format them with themes RunAfter installing, you can run local server to test Hexo1$ hexo server You can check your server at localhost:4000 (default port: 4000) CommandsNew postCreate a new post1$ hexo new \"My New Post\" GenerateGenerate static files1$ hexo generate OR1$ hexo g Deploy to remote sites1$ hexo deploy OR1$ hexo d More CommandsYou can fine more commands in this Link.","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"Hexo","slug":"Dev/Hexo","permalink":"https://augusdn.github.io/kr/categories/Dev/Hexo/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://augusdn.github.io/kr/tags/Hexo/"},{"name":"Blog","slug":"Blog","permalink":"https://augusdn.github.io/kr/tags/Blog/"},{"name":"GitHub","slug":"GitHub","permalink":"https://augusdn.github.io/kr/tags/GitHub/"},{"name":"Node.js","slug":"Node-js","permalink":"https://augusdn.github.io/kr/tags/Node-js/"},{"name":"Git","slug":"Git","permalink":"https://augusdn.github.io/kr/tags/Git/"}]},{"title":"HTC Vive Unboxing","slug":"HTC-Vive","date":"2016-07-21T11:15:39.000Z","updated":"2018-02-03T12:50:10.322Z","comments":true,"path":"2016/07/21/HTC-Vive/","link":"","permalink":"https://augusdn.github.io/kr/2016/07/21/HTC-Vive/","excerpt":"","text":"About HTC Vive Postage Box Inside the box Manual Front View VR Components VIVE Controller and Base station Controller Charger Cables and stand Overall About HTC Vive (Steam VR):HTC Vive is a virtual reality headset developed by HTC and Valve Corporation, released on 5 April 2016. This headset is designed to utilize “room scale” technology to turn a room into 3D space via sensors, with the virtual world allowing the user to navigate naturally, with the ability to walk around and use motion tracked handheld controllers to vividly manipulate objects, interact with precision, communicate and experience immersive environments WikipediaHTC VIVE I have ordered HTC VIVE in Australia, where it is not available yet locally. It seems like stock for VIVE is not enough for demands so had to wait for few weeks after the order was completed. Interesting thing about the item was it came from China not from US. HTC VIVE Postage Box As I open the box, there was black box with smooth surface covered in plastic bag. On the side, there was a Styrofoam to hold the box and prevent the external force to damage the item. Box showing Steam VR Logo and HTC VIVE with image of actual VR. Inside the box This picture is showing how it looks inside as I open the box. On the left-top, there is Get Started manual. Below the manual there was VIVE controller placed in sponge. On the right there was HTC VIVE covered in plastic bag. Overview of ManualImage on top is a manual of how to use VR. This image is close up view on list of parts on the manual. There are A-N items, which are label for each component. This label is has a tag below in text with different languages. A. Base station x 2B. Sync cable (optional)C. Base station power adapter x 2D. Mounting kitE. Link BoxF. Link box mounting padG. Link box power adapterH. HDMI cableI. USB cableJ. EarbudsK. Alternate face cushion (narrow)L. Cleaning clothM. DocumentationN. Headset with 3-in-1 cable and audio cableO. Controller (with lanyard) x 2P. Micro-USB charger x 2 HTC VIVE Front View VR Components Warranty document and cleaning cloth on left-top, VR-Desktop connector, alternate face cushion, Power cable for VR-Desktop connector, earbud, HDMI cable and USB male-male cable in clock wise. VIVE Controller and Base station Controller Charger x2Two VIVE controllers and two base station placed in sponge container. Below the controller, there is a box containing two charger. Chargers seems same with most of the android chargers and when controllers are plugged in, they light up with RED or Green Colour depends on their battery level. Image below shows the Power cable for base station and stand for holding the base station. Also there is a document for how to install base station. I forgot to take off the plastic cover for base stand but every other parts were also came with plastic cover too. Base station power cable and sync cable with stand OverallHTC VIVE a.k.a. Steam VR has great box components and really looking forward to use this with new desktop we have ordered. I will post the installing guide and also few reviews after I use this awesome looking VR.","categories":[{"name":"Technology","slug":"Technology","permalink":"https://augusdn.github.io/kr/categories/Technology/"},{"name":"Unboxing","slug":"Technology/Unboxing","permalink":"https://augusdn.github.io/kr/categories/Technology/Unboxing/"}],"tags":[{"name":"Steam","slug":"Steam","permalink":"https://augusdn.github.io/kr/tags/Steam/"},{"name":"Steam VR","slug":"Steam-VR","permalink":"https://augusdn.github.io/kr/tags/Steam-VR/"},{"name":"VR","slug":"VR","permalink":"https://augusdn.github.io/kr/tags/VR/"},{"name":"HTC-VIVE","slug":"HTC-VIVE","permalink":"https://augusdn.github.io/kr/tags/HTC-VIVE/"}]},{"title":"Doomsday Algorithm","slug":"Doomsday-Algorithm","date":"2016-03-22T07:02:42.000Z","updated":"2018-02-03T12:50:10.319Z","comments":true,"path":"2016/03/22/Doomsday-Algorithm/","link":"","permalink":"https://augusdn.github.io/kr/2016/03/22/Doomsday-Algorithm/","excerpt":"","text":"Doomsday algorithm in C language Doomsday algorithm in C language What is doomsday? Applying doomsday algorithm How to calculate doomsday of the year Calculate a given date Download sample C file What is doomsday?The doomsday rule or doomsday algorithm is a way of calculating the day of the week of a given date. It provides a perpetual calendar because the Gregorian calendar moves in cycles of 400 years. Wikipediaen.wikipedia.org/wiki/Doomsday_rule Applying doomsday algorithm Determine the &quot;anchor day&quot; for the century. Use the anchor day for the century to calculate the doomsday for the year. Choose the closest date out of the ones that always fall on the doomsday. (e.g. 4/4, 6/6, 8/8), and count the number of days (modulo 7, %7 in C) between that date and the date in question to arrive at the date of the week. How to calculate doomsday of the yearHere are the list of doomsday standard for years.1800~1899 is Friday1900~1999 is Wednesday2000~2099 is Tuesday2100~2199 is SundayThen it loops Using the data above, we can calculate a doomsday of the year we choose.For example I will choose 2016 03 24 Formatted as YYYYMMDD. Divide last two digits of Year with 12 - YYYY -&gt; YYYY / 12 -&gt; a…b2016-&gt; 16/12 = 1 ... 4 as remainder ( a is 1 and b is 4 ) Divide the remainder with 4 -&gt; b/44/4 = 1 (c is 1) Anchor day can be calculated with list above with YYYY and add a+b+c on the anchor day.2016 will be between 2000~2099, Tuesday.a+b+c = 1 + 4 + 1 = 6Now add result from 2 on Tuesday. Which will be Tuesday + 6 = Monday.2016&#39;s doomsday is Monday Calculate a given dateNow we know 2016’s doomsday is on Monday. Then we can simply calculate the difference in date between doomsday and the day we want to know, to calculate the day. Using the example above, 2016 03 24, we know 2016’s doomsday is on Monday and I will use February 29th for my doomsday since it’s a leap year. Days until February 29th are 60 days and days until 24th of March is 84 days. Now we can calculate the day with the function I wrote on the program. dayOfWeek = ((doomsday + DAYS_PER_WEEK) - (DAYS_PER_WEEK + ((daysToEndOfFeb - daysToInputDay) % DAYS_PER_WEEK))) % DAYS_PER_WEEK; This will give me a day of week with leap year case. dayOfWeek = ((4 + 7) - (7 + ((60 - 84) % 7))) % 7;= ((11) - (7 + (-3))) % 7;= 7 % 7= 0= Thursday Download sample C fileYou can download sample C file from HERE","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"C","slug":"Dev/C","permalink":"https://augusdn.github.io/kr/categories/Dev/C/"}],"tags":[{"name":"C","slug":"C","permalink":"https://augusdn.github.io/kr/tags/C/"},{"name":"Programming","slug":"Programming","permalink":"https://augusdn.github.io/kr/tags/Programming/"},{"name":"Algorithm","slug":"Algorithm","permalink":"https://augusdn.github.io/kr/tags/Algorithm/"},{"name":"Doomsday","slug":"Doomsday","permalink":"https://augusdn.github.io/kr/tags/Doomsday/"},{"name":"C Programming","slug":"C-Programming","permalink":"https://augusdn.github.io/kr/tags/C-Programming/"}]},{"title":"putty and xming","slug":"putty-and-xming","date":"2016-03-08T22:45:21.000Z","updated":"2018-02-03T12:50:10.347Z","comments":true,"path":"2016/03/09/putty-and-xming/","link":"","permalink":"https://augusdn.github.io/kr/2016/03/09/putty-and-xming/","excerpt":"","text":"Tool to access SSH remotely Tool to access SSH remotely PuTTY Download PuTTY Xming Download Xming Setup Xming with PuTTY PuTTYPuTTY is an SSH and telnet client, developed originally by Simon Tatham for the Windows platform. PuTTY is open source software that is available with source code and is developed and supported by a group of volunteers. PuTTY.orgwww.putty.org Download PuTTYYou can download latest PuTTY HERE.Depends on which Windows version you use, there are 32-bit and 64-bit versions available.If you are not sure about which version you need to download, Read this FAQ entry. XmingXming is the leading X Window System Server for Microsoft Windows 8/7/Vista/XP (+ server 2012/2008/2003). It is fully featured, small and fast, simple to install and because it is standalone native Microsoft Windows, easily made portable (not needing a machine-specific installation). Xmingsourceforge.net/projects/xming Basically, Xming is a software to enable your terminal to have graphical output on your local machine.If you don’t set up Xming and access remotely with PuTTY, you won’t be able to use graphical softwares. Download XmingYou can download Xming HERE Setup Xming with PuTTYRun PuTTY, go under Connection-&gt;SSH-&gt;X11.1234567Connection├── ...├── SSH| ├── ...| ├── X11 &lt;---| ├── ...├── ... Tick &quot;Enable X11 forwarding&quot; then set the &quot;X display location&quot; to localhost:0","categories":[{"name":"Dev","slug":"Dev","permalink":"https://augusdn.github.io/kr/categories/Dev/"},{"name":"Tools","slug":"Dev/Tools","permalink":"https://augusdn.github.io/kr/categories/Dev/Tools/"}],"tags":[{"name":"Programming","slug":"Programming","permalink":"https://augusdn.github.io/kr/tags/Programming/"},{"name":"SSH","slug":"SSH","permalink":"https://augusdn.github.io/kr/tags/SSH/"},{"name":"putty","slug":"putty","permalink":"https://augusdn.github.io/kr/tags/putty/"},{"name":"xming","slug":"xming","permalink":"https://augusdn.github.io/kr/tags/xming/"},{"name":"telnet","slug":"telnet","permalink":"https://augusdn.github.io/kr/tags/telnet/"}]}]}